In [81]:
import numpy as np
import pandas as pd
import random

Ejercicio 1. ¿Qué diferencia hay entre una Serie y un DataFrame?

In [82]:
# Las Series tienen una dimensión(índices) y los DataFrames tienes 2 dimensiones (índices y columnas).

Ejercicio 2. Momento de trabajar con Series.

In [83]:
valores = list(np.random.randint(1,50,(7)))
valores

[42, 33, 35, 19, 20, 33, 1]

In [84]:
indices = ["Lunes", "Martes", "Miercoles", "Jueves", "Viernes", "Sabado", "Domingo"]
indices

['Lunes', 'Martes', 'Miercoles', 'Jueves', 'Viernes', 'Sabado', 'Domingo']

In [85]:
# convertimos las dos listas a serie

semana = pd.Series(valores, indices)
semana

Lunes        42
Martes       33
Miercoles    35
Jueves       19
Viernes      20
Sabado       33
Domingo       1
dtype: int64

In [116]:
# A partir de las dos listas anteriores cread un diccionario usando un bucle for. 
# Hemos creado el diccionario de dos formas. Usaremos para el ejercicio la última "diccionario = dict(zip(indices, valores))" porque es la que nos
# ha resultado más comoda para trabajar, pero a continuación dejamos otro método con el bucle for y una list comprehension.

keys1 = indices
values1 = valores

In [117]:
lista_del_zip = list(zip(keys1, values1))
lista_del_zip

[('Lunes', 42),
 ('Martes', 33),
 ('Miercoles', 35),
 ('Jueves', 19),
 ('Viernes', 20),
 ('Sabado', 33),
 ('Domingo', 1)]

In [113]:
dicc2 = {k: v for k, v in lista_del_zip}

In [114]:
dicc2

{'Lunes': 42,
 'Martes': 33,
 'Miercoles': 35,
 'Jueves': 19,
 'Viernes': 20,
 'Sabado': 33,
 'Domingo': 1}

In [ ]:
# Continuámos con el ejercicio.
# A partir de las dos listas anteriores cread un diccionario usando un bucle for. 
# Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez.

diccionario = dict(zip(indices, valores))
diccionario

{'Lunes': 2,
 'Martes': 40,
 'Miercoles': 9,
 'Jueves': 20,
 'Viernes': 27,
 'Sabado': 6,
 'Domingo': 23}

In [ ]:
# Crea una Serie con el diccionario creado en el punto anterior.

semana2 = pd.Series(diccionario)
semana2

Lunes         2
Martes       40
Miercoles     9
Jueves       20
Viernes      27
Sabado        6
Domingo      23
dtype: int64

In [ ]:
# ¿Qué forma tiene esta última Serie?

semana2.shape

(7,)

In [ ]:
# ¿Qué tipo de datos tiene?

semana2.dtypes

dtype('int64')

In [ ]:
# ¿Qué tamaño tiene?

semana2.size

7

In [ ]:
# ¿Cuáles son los índices de la Serie?

semana2.index

Index(['Lunes', 'Martes', 'Miercoles', 'Jueves', 'Viernes', 'Sabado',
       'Domingo'],
      dtype='object')

In [ ]:
# ¿Y los values?

semana2.values

array([ 2, 40,  9, 20, 27,  6, 23])

In [ ]:
# Extraed el valor para el índice "lunes".

semana2["Lunes"]

2

In [ ]:
# Extraed el valor para el índice "lunes", "martes" y "miércoles".

semana2["Lunes" : "Miercoles"]

Lunes         2
Martes       40
Miercoles     9
dtype: int64

In [ ]:
# Extraed el valor para el índice "lunes" y "domingo".

semana2[["Lunes", "Domingo"]]

Lunes       2
Domingo    23
dtype: int64

Ejercicio 3. Es el turno de los DataFrames

In [ ]:
# Cread un array de dos dimensiones con 4 filas y 3 columnas.

array1 = np.random.randint(1,50,(4, 3))
array1

array([[48, 31, 45],
       [22, 17, 48],
       [13, 24, 23],
       [10, 24, 41]])

In [ ]:
# Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

paises = pd.DataFrame(array1, columns =["España", "Francia", "Italia"])
paises

   España  Francia  Italia
0      48       31      45
1      22       17      48
2      13       24      23
3      10       24      41

In [ ]:
# Descargad el archivo "medallas" y cargad el DataFrame con la siguiente línea de código:

df = pd.read_csv("medallas.csv", index_col=["País"])

In [ ]:
# Usando el loc extraed todas las columnas de la fila.

df.loc[:]

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [ ]:
# Usando el loc extraed todas las columnas de China e Irán.

df.loc[["China", "Irán"],]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

In [ ]:
# Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

df.loc[["China", "Irán"], ["Oro", "Plata", "Bronce"]]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

In [ ]:
df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [ ]:
# Usando el iloc extraed la información de la India. Devolved todas las columnas.

df.iloc[5,:]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

In [ ]:
# Usando el iloc extraed todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

df.iloc[1::2, :]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

In [ ]:
# Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

df.iloc[1::2, 1:]

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

In [ ]:
# Contestad a las siguientes preguntas:
# ¿Qué país consiguió más de 200 medallas de oro?

df.loc[(df.Oro > 200), 'Oro']

País
China            1473
Japón            1032
Corea del Sur     745
Name: Oro, dtype: int64

In [ ]:
# ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

df.loc[(df.Oro > 200) & (df.Plata > 1000), ['Oro', 'Plata']]

        Oro  Plata
País
Japón  1032   1037

In [ ]:
# ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

df.loc[(df.Oro > 200) | (df.Bronce > 700), ['Oro', 'Bronce']]

                Oro  Bronce
País
China          1473     720
Japón          1032     985
Corea del Sur   745     827

In [ ]:
# Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna

del df["Unnamed: 0"]

In [ ]:
df

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

In [ ]:
# Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

df_total = ["Oro", "Plata","Bronce"]

df.insert(3, "Total", df[df_total].sum(axis=1))

In [ ]:
df

                  Oro  Plata  Bronce  Total
País
China            1473    994     720   3187
Japón            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Irán              179    181     197    557
Kazajistán        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taipéi       99    144     276    519
Corea del Norte    91    120     235    446